<template>
  <div class="section">
    <div class="box" id="services-container">
      <h2 class="title is-3 pb-3 unbounded-title">Корпоративный сайт</h2>
      <h3 class="subtitle is-5">Многостраничный сайт для бизнеса, поможет рассказать о продукте</h3>
      <div class="box" id="services-container-inner">
        <ServiceOption
          title="O1. Брифинг"
          text="Перед началом работы мы проводим с вами брифинг, чтобы уточнить все нюансы и особенности проекта, не упустить важные детали. Это позволяет нам эффективно использовать время клиентов и сразу переходить к исследованиям."
        />
        <ServiceOption
          title="O2.  Исследования"
          text="Получив от вас необходимую информацию по проекту, мы анализируем конкурентов, удобство пользования сайтом, качество дизайна и потребности ваших клиентов, чтобы определить оптимальные решения."
        />
        <ServiceOption
          title="O3. Дизайн"
          text="На этом этапе мы разрабатываем функциональный прототип сайта, отображающий структуру контента и функционала. После утверждения этого прототипа, мы начнем работу над визуальным оформлением сайта, согласовывая с вами его общий вид."
        />
        <ServiceOption
          title="O4.  Разработка"
          text="Наша команда разработчиков преобразует ваш веб-дизайн и утвержденный функционал в интерактивный веб-сайт с применением передовых web-технологий, таких как Vue.js, Python Django + REST API, контейнеризация c Docker. Наш подход сосредоточен на адаптации каждого элемента к вашим уникальным потребностям, чтобы гарантировать высокое качество и уникальный пользовательский опыт."
        />
        <div>
          <h3 class="title is-4">Примечание:</h3>
          <h4 class="subtitle is-5">Конечные сроки могуть значительно меньше и обговариваются с клиентом</h4>
        </div>
      </div>
    </div>
  </div>
</template>
<script setup>
import ServiceOption from './ServiceOption.vue'
</script>
<style scoped>
#services-container {
  border-color: #1b1b1b;
  border-width: 1rem;
  background-color: #121212;
}
#services-container-inner {
  background-color: #232323;
  border-color: #2e2e2e;
  border-width: 1rem;
}
</style>
